package Homework_3;

public class Task6 {
// создайте массив строк (размер 10)
// запишите в него 10 имен
// в цикле выведите на экран только первых трех игроков

    public static void main(String[] args) {
        String[] players = {"Лионель Месси", "Диего Марадона", "Пеле", "Зинедин Зидан", "Криштиану Роналду",
                            "Мишель Платини", "Лев Яшин", "Марко Ван Бастон", "Роналдо", "Луиш Фигу"};
        for (int i = 0; i < 3; i++){
            System.out.println(players[i]);
        }
    }
}
